tutorials/AhmedBody2D/runROM/constant/MRFProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MRF
{
    active false;
    selectoinMode cellZone;
    cellZone region0;
    nonRotatingPatches ();
    axis (0.000000 0.000000 1.000000);
    origin (0.000000 0.000000 0.000000);
    omega 0.000000;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
