tutorials/AhmedBody2D/runROM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

convertToMeters 1;

vertices  
(
  (-2.0 -0.0 0.0)
  ( 6.0 -0.0 0.0)
  ( 6.0  2.0 0.0)
  (-2.0  2.0 0.0)
  (-2.0 -0.0 2.0)
  ( 6.0 -0.0 2.0)
  ( 6.0  2.0 2.0)
  (-2.0  2.0 2.0)
);

blocks  
(
    hex ( 0 1 2 3 4 5 6 7) (20 5 5) simpleGrading (1 1 1)
);

edges  
(
);

patches  
( 
  patch inlet
  (
      (0 4 7 3)
  ) 
  patch outlet
  (
      (1 2 6 5)
  ) 
  symmetry back
  (
      (0 1 5 4)
  ) 
  patch front
  (
      (3 7 6 2)
  ) 
  wall bot
  (
      (0 3 2 1)
  ) 
  patch top
  (
      (4 5 6 7)
  )
);

mergePatchPairs  
(
);
